/*====================================
   ■■■ 연산자 (Operator) ■■■
======================================*/

// 비트 단위 연산자

public class Test027
{
	public static void main(String[] args)
	{
		int x = 128;	// 00000000 00000000 00000000 10000000

		System.out.printf("x << 3 : %d\n", x << 3);	
		// 00000000 00000000 00000100 00000000 => 1024
		System.out.printf("x * 8  : %d\n", x * 8);

		System.out.printf("x >> 3 : %d\n", x >> 3);
		// 00000000 00000000 00000000 00010000 => 16
		System.out.printf("x / 8  : %d\n", x / 8);

		System.out.printf("x << 24 : %d\n", x << 24);	// int type의 음수 최솟값 -> -2147483648
		// 10000000 00000000 00000000 00000000
		System.out.printf("x << 25 : %d\n", x << 25);	// 0
		System.out.printf("x << 24 : %d\n", x << 24);	// 0
		System.out.printf("x << 31 : %d\n", x << 31);
		System.out.printf("x << 32 : %d\n", x << 32);
		// => 31까지는 0, 32칸 돌아오면 원래 자기가 갖고 있는 값 됨

	}
}

// 실행 결과
/*
x << 3 : 1024
x * 8  : 1024
x >> 3 : 16
x / 8  : 16
x << 24 : -2147483648
x << 25 : 0
x << 24 : -2147483648
x << 31 : 0
x << 32 : 128
계속하려면 아무 키나 누르십시오 . . .
*/