/*====================================
   ■■■ 연산자 (Operator) ■■■
======================================*/

// 비트 단위 연산자

public class Test025
{
	public static void main(String[] args)
	{
		int a = 13, b = 7;
		int c, d, e;

		c = a & b;	// bit AND
		d = a | b;	// bit OR
		e = a ^ b;	// exclusive OR

		System.out.printf("a & b : %d\n", c);
		System.out.printf("a | b : %d\n", d);
		System.out.printf("a ^ b : %d\n", e);

	}
}

// 실행 결과
/*
a & b : 5
a | b : 15
a ^ b : 10
계속하려면 아무 키나 누르십시오 . . .
*/

/* << 결과 왜 그렇게 나왔는지 확인해보기 >>

	13 -> 00001101
   & 7 -> 00000111
   ----------------
		  00000101 -> 4 + 1 -> 5

	13 -> 00001101
   | 7 -> 00000111
   ----------------
   		  00001111 -> 8 + 4 + 2 + 1 -> 15
		  => 특정 비트 아래 모두 1이면 그 비트값보다 -1 작은 값임

	13 -> 00001101
   ^ 7 -> 00000111
   ----------------
   		  00001010 -> 8 + 2 -> 10
*/